---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingType.AddInsulationType(System.String)
source: html/b8c6e5cd-0913-b410-f2c2-ef2592da1536.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingType.AddInsulationType Method

Add a new kind of insulation type into this temperature rating type.

## Syntax (C#)
```csharp
public InsulationType AddInsulationType(
	string name
)
```

## Parameters
- **name** (`System.String`) - Name of insulation type symbol to be constructed and added.

## Returns
Constructed insulation type instance.